Catalogs/ЗначенияХарактеристикКТРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ЗначенияХарактеристикКТРУ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ХарактеристикиКТРУ</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыКТРУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РеквизитыКТРУ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РеквизитыКТРУ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РеквизитыКТРУ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяМинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяМаксимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыЗначенийХарактеристикиКТРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыЗначенийХарактеристикиКТРУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диапазон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗначенияХарактеристикКТРУ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ТипЗначений");
	Если ТипЗначения = Перечисления.ТипыЗначенийХарактеристикиКТРУ.ФиксированноеЗначение Тогда
		МинимальноеЗначение = Неопределено;
		МаксимальноеЗначение = Неопределено;
		Наименование = Строка(Значение);
	Иначе
		Значение = Неопределено;
		Если МинимальноеЗначение = Неопределено Тогда
			Наименование = ?(ВключаяМаксимальноеЗначение, "≤ ", "< ") + Формат(МаксимальноеЗначение, "ЧН=; ЧГ=");
		ИначеЕсли МаксимальноеЗначение = Неопределено Тогда
			Наименование = ?(ВключаяМинимальноеЗначение, "≥ ", "> ") + Формат(МинимальноеЗначение, "ЧН=; ЧГ=");
		Иначе
			Наименование = ?(ВключаяМинимальноеЗначение, "[", "(")
				+ Формат(МинимальноеЗначение, "ЧН=; ЧГ=")
				+ "; "
				+ Формат(МаксимальноеЗначение, "ЧН=; ЧГ=")
				+ ?(ВключаяМаксимальноеЗначение, "]", ")");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
